Autodesk.Revit.DB.Macros.ModuleStatus
The Macro module status.
Since:
2014
Since:
2014

Autodesk.Revit.DB.Macros.ModuleStatus.NotBuild
The module is not build.

Autodesk.Revit.DB.Macros.ModuleStatus.Corrupt
The module is corrupt.

Autodesk.Revit.DB.Macros.ModuleStatus.Disabled
The module is disabled.

Autodesk.Revit.DB.Macros.ModuleStatus.LoadFailed
Failed to load the module.

Autodesk.Revit.DB.Macros.ModuleStatus.BuildFailed
Failed to build the module.

Autodesk.Revit.DB.Macros.ModuleStatus.Loaded
The module is loaded.